<a href="https://colab.research.google.com/github/wangsongyuan98/python_sql_connection/blob/main/sql_%26_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [81]:
!pip install sqlalchemy &> /dev/null

In [82]:
import sqlite3
import pandas as pd
import sqlalchemy

simple connection and creating database

In [83]:
connection = sqlite3.connect('ourdatabase.db') #connect to database

In [84]:
cursor = connection.cursor() #allow us to execute sql statement

In [85]:
cursor.execute("CREATE TABLE employees (employee_id INTEGER,first_name text,last_name text NOT NULL,email text NOT NULL,phone_number text,hire_date text NOT NULL,job_id INTEGER NOT NULL,salary double NOT NULL,manager_id INTEGER);")

In [86]:
connection.commit()

In [87]:
cursor.execute("INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id) VALUES (100,'Steven','King','steven.king@sqltutorial.org','515.123.4567','1987-06-17',4,24000.00,NULL);")

In [88]:
cursor.execute("INSERT INTO employees(employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,manager_id) VALUES (101,'Neena','Kochhar','neena.kochhar@sqltutorial.org','515.123.4568','1989-09-21',5,17000.00,100);");

In [89]:
cursor.execute('select * from employees')

In [90]:
cursor.fetchall() #fetchone()

[(100,
  'Steven',
  'King',
  'steven.king@sqltutorial.org',
  '515.123.4567',
  '1987-06-17',
  4,
  24000.0,
  None),
 (101,
  'Neena',
  'Kochhar',
  'neena.kochhar@sqltutorial.org',
  '515.123.4568',
  '1989-09-21',
  5,
  17000.0,
  100)]

In [91]:
for i in cursor.execute("select * from employees"):
  print(i)

(100, 'Steven', 'King', 'steven.king@sqltutorial.org', '515.123.4567', '1987-06-17', 4, 24000.0, None)
(101, 'Neena', 'Kochhar', 'neena.kochhar@sqltutorial.org', '515.123.4568', '1989-09-21', 5, 17000.0, 100)

In [92]:
connection.close()

write df into sql database/get sql table to df

In [93]:
engine = sqlalchemy.create_engine('sqlite:////content/ourdatabase.db')  #connection has more restriction than engine

In [94]:
pd.read_sql('employees', engine)

Empty DataFrame
Columns: [employee_id, first_name, last_name, email, phone_number, hire_date, job_id, salary, manager_id]
Index: []

to sql

In [95]:
df1 = pd.DataFrame([{'employee_id':25,'first_name': 'sx','last_name':'xz','email':'nehar@sqltutorial.org','phone_number':121222,'hire_date':'1949-09-21','job_id':15,'salary':0,'manager_id':21}])

In [96]:
df1

   employee_id first_name last_name  ... job_id  salary manager_id
0           25         sx        xz  ...     15       0         21

[1 rows x 9 columns]

In [97]:
df1.to_sql('employees',engine, if_exists='append', index=False) #create a whole new table

In [98]:
!pip install yfinance &> /dev/null

In [99]:
import yfinance as yf

In [100]:
df = yf.download('AAPL', start = '2021-10-01')

[*********************100%***********************]  1 of 1 completed

In [101]:
df

                  Open        High  ...   Adj Close    Volume
Date                                ...
2021-10-01  141.899994  142.919998  ...  142.649994  94639600
2021-10-04  141.759995  142.210007  ...  139.139999  98322000
2021-10-05  139.490005  142.240005  ...  141.110001  80861100
2021-10-06  139.470001  142.149994  ...  142.000000  83221100
2021-10-07  143.059998  144.220001  ...  143.289993  61732700
2021-10-08  144.029999  144.179993  ...  142.899994  58718700
2021-10-11  142.270004  144.809998  ...  142.809998  64452200
2021-10-12  143.229996  143.250000  ...  141.509995  73035900
2021-10-13  141.240005  141.399994  ...  140.910004  78762700
2021-10-14  142.110001  143.880005  ...  143.759995  69838600
2021-10-15  143.770004  144.895004  ...  144.839996  65076405

[11 rows x 6 columns]

In [104]:
df.to_sql('AAPL',engine)

In [105]:
pd.read_sql('AAPL', engine)

         Date        Open        High  ...       Close   Adj Close    Volume
0  2021-10-01  141.899994  142.919998  ...  142.649994  142.649994  94639600
1  2021-10-04  141.759995  142.210007  ...  139.139999  139.139999  98322000
2  2021-10-05  139.490005  142.240005  ...  141.110001  141.110001  80861100
3  2021-10-06  139.470001  142.149994  ...  142.000000  142.000000  83221100
4  2021-10-07  143.059998  144.220001  ...  143.289993  143.289993  61732700
5  2021-10-08  144.029999  144.179993  ...  142.899994  142.899994  58718700
6  2021-10-11  142.270004  144.809998  ...  142.809998  142.809998  64452200
7  2021-10-12  143.229996  143.250000  ...  141.509995  141.509995  73035900
8  2021-10-13  141.240005  141.399994  ...  140.910004  140.910004  78762700
9  2021-10-14  142.110001  143.880005  ...  143.759995  143.759995  69838600
10 2021-10-15  143.770004  144.895004  ...  144.839996  144.839996  65076405

[11 rows x 7 columns]